{
    "pointers": [
        { "topic": "How to install multiple instances of Ubuntu in WSL2",
          "type": "url",
          "context": "https://cloudbytes.dev/snippets/how-to-install-multiple-instances-of-ubuntu-in-wsl2"
        },
        { "topic": "How to read Capacitor Codes",
          "type": "url",
          "context": "http://www.4crawler.com/Diesel/CheapTricks/Tachometer/Capacitor.html"
        },
        { "topic": "Reset the Roomba battery 500 and 600 series",
          "type": "url",
          "context": "https://www.bateriasrobot.com/en/content/7-reset-the-roomba-battery"
        },
        { "topic": "How to Get Stock Prices in Microsoft Excel",
          "type": "url",
          "context": "https://www.exceldemy.com/get-stock-prices-in-excel/"
        },
        { "topic": "How to keep positive mindset for a retiree",
          "type": "multi-sections",
          "context": "/files/tips/retiree-positive-mindset.txt"
        },
        { "topic": "How to quickly tryout JavaScript code",
          "type": "multi-sections",
          "context": "/files/tips/tryout-javascript.txt"
        },
        { "topic": "What is Wyliodrin",
          "type": "popup",
          "context": "<a href='https://www.wyliodrin.com'>Wyliodrin</a> is a service that allows you to visually create applications for an embedded board and control it directly from the browser."
        },
        { "topic": "What is Capacitor JS",
          "type": "popup",
          "context": [ "<a href='https://capacitorjs.com'>Capacitor</a> is an open-source successor to Apache Cordova and Adobe PhoneGap",
                       "from Ionic team, which allows you to build an application with Node.js and modern front-end web technologies,",
                       "and run it everywhere including web browsers, desktop platforms, and native mobile devices (Android and iOS).",
                       "Capacitor provides an API that allows developers to call native APIs through JavaScript and deploy their web app",
                       "through the iOS App Stores and Google Play, it sits between the various APIs from the Browser, native iOS, and native",
                       "Android, when developers call Capacitor APIs, the proxied APIs are actually called. It also provides a set of",
                       "<strong>plugins</strong> to access native features of devices, such as the camera, without having to use the specific",
                       "low-level code for each platform. Capacitor is designed to be dropped into any modern JavaScript application",
                       "for deploying the app to native, and it’s framework-agnostic, and could be used with Angular, React, Preact,",
                       "or no framework at all." ]
        },
        { "topic": "What is Google Cloud Functions",
          "type": "popup",
          "context": [ "<a href='https://cloud.google.com/functions/docs/concepts/overview'>Google Cloud Functions</a>",
                       "is a serverless execution environment for building and connecting cloud services.",
                       "Cloud Functions are attached to events emitted from the cloud infrastructure and services,",
                       "they are triggered when an event being watched is fired. Functions are automatically scaled and executed",
                       "in a fully managed environment, there is no need to provision any infrastructure or worry about managing any servers." ]
        },
        { "topic": "What's different between GET and POST HTTP methods",
          "type": "popup",
          "context": [ "According to <a href='https://www.theserverside.com/video/GET-vs-POST-Whats-the-difference'>this article</a>,",
                       "the key difference between GET and POST HTTP methods is that",
                       "<strong>GET only retrieves data from a server while POST can modify or update server-side resources</strong>.",
                       "While GET uses the URL query string to send the request to a server, POST sends the data stored in the HTTP request body.",
                       "Read <a href='https://www.w3schools.com/tags/ref_httpmethods.asp'>more comparisons in this W3CSchools article</a>." ]
        },
        { "topic": "What's different between Web Crawling (網路爬蟲) and Web Scraping (網頁抓取)",
          "type": "popup",
          "context": [ "<a href='https://en.wikipedia.org/wiki/Web_scraping'>Web scraping</a> is about extracting data from one or more",
                       "websites, while <a href='https://en.wikipedia.org/wiki/Web_crawler'>web crawling</a> is about finding or discovering",
                       "URLs or links on the web. Usually, in web data extraction projects, you first crawl - or discover - the URLs,",
                       "download the HTML files, and then scrape the data from those files, and do something with it." ]
        },
        { "topic": "Why Windows time changes after booting Ubuntu on a dual-booting system",
          "type": "popup",
          "context": [ "While Windows stores local time in the hardware clock (RTC), Ubuntu/Linux stores UTC time in the hardware clock by default.",
                       "When switching between operating systems, each interprets the hardware clock time differently and causes the time discrepanchy.",
                       "Run this command in Ubuntu to prevent the time from changing when switching operating systems:<br>",
                       "<code>timedatectl set-local-rtc 1 --adjust-system-clock</code>" ]
        },
        { "topic": "Useful git commands",
          "type": "file",
          "context": "/files/tips/useful-git-commands.txt"
        },
        { "topic": "大型廢棄家具垃圾處理",
          "type": "popup",
          "context": "電洽(02)2514-7712 松山區環保局預約大型家具清運。"
        },
        { "topic": "一般公寓大樓經過停水後水壓變小解決方式",
          "type": "url",
          "context": "https://tinyurl.com/yefejftb"
        },
        { "topic": "如何去除馬桶內側尿垢",
          "type": "popup",
          "context": "將200cc水與一大匙檸檬酸混合置入噴瓶，噴灑在馬桶內側的尿垢或水垢上，靜置一段時間，再用馬桶刷輕輕沖水刷洗。詳見<a href='https://health.tvbs.com.tw/life/349443'>這篇報導</a>。"
        }
    ]
}
